export default [{
    title: '手机号',
    rule: /^((13[0-9])|(15[^4,\D])|(17[0-9])|(18[0-9])|(19[0-9]))\d{8}$/,
}, {
    title: '大写字母',
    rule: /^[A-Z]+$/,
}, {
    title: '日期,如: 2000-01-01',
    rule: /^\d{4}(-)\d{1,2}\1\d{1,2}$/,
}, {
    title: 'email地址',
    rule: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
},{
    title: '国内电话号码,如: 0341-86091234',
    rule: /\d{3}-\d{8}|\d{4}-\d{7}/,
},
{
    title: '身份证号(15位、18位数字)，最后一位是校验位，可能为数字或字符X',
    rule: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/,
},

{
    title:'帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线',
    rule: /^[a-zA-Z][a-zA-Z0-9_]{4,15}$/
}

];